Repository: reserved-words/CorTabernaclChoir
Catalog: CorTabernaclChoir/CorTabernaclChoir.Models/Resources.*.resx
Languages: cy_gb

# AboutAccompanist
source: About the Accompanist
cy_gb: Am y Cyfeilydd

# AboutMusicalDirector
source: About the Musical Director
cy_gb: Am y Cyfarwyddwr Cerdd

# AboutTitle
source: About the Choir
cy_gb: Am y Côr

# AllVisitsLink
source: Click here to view all visits
cy_gb: Cliciwch yma am fwy o deithiau

# ContactEmail
source: Email
cy_gb: Ebost

# ContactInvalidEmailAddress
source: Invalid Email Address
cy_gb: Cyfieriad Ebost Anghywir

# ContactMessage
source: Message
cy_gb: Neges

# ContactName
source: Name
cy_gb: Enw

# ContactSubmit
source: Submit
cy_gb: Anfon

# ContactTitle
source: Contacting the Choir
cy_gb: Cysylltu â'r Côr

# GenericErrorMessage
source: An unexpected error occurred. We apologise for any inconvenience. If this error persists please contact us.
cy_gb: Roedd problem annisgwyl. Ymddiheurwn am unrhyw anghyfleuster. Os yw'r broblem yn parhau cysylltwch â ni os gwelwch yn dda.

# HomeAccompanist
source: Accompanist
cy_gb: Cyfeilydd

# HomeMusicalDirector
source: Musical Director
cy_gb: Cyfarwyddwr Cerdd

# HomeTitle
source: Welcome
cy_gb: Croeso

# JoinAuditions
source: Auditions
cy_gb: Gwrandawiadau

# JoinConcerts
source: Concerts
cy_gb: Cyngherddau

# JoinLocation
source: Where
cy_gb: Ble

# JoinRehearsalTimes
source: Rehearsal Times
cy_gb: Amser Ymarferion

# JoinSubscriptions
source: Subscriptions
cy_gb: Tanysgrifiadau

# JoinTitle
source: Joining the Choir
cy_gb: Ymuno â'r Côr

# MenuAbout
source: About
cy_gb: Amdanom

# MenuContact
source: Contact
cy_gb: Cysylltu

# MenuGallery
source: Gallery
cy_gb: Oriel

# MenuHome
source: Home
cy_gb: Hafan

# MenuJoin
source: Join
cy_gb: Ymuno

# MenuNews
source: News
cy_gb: Newyddion

# MenuRecordings
source: Recordings
cy_gb: Recordiadau

# MenuVisits
source: Visits
cy_gb: Teithiau

# MenuWorks
source: Works
cy_gb: Gweithiau

source: Musical Director
cy_gb: Cyfarwyddwr Cerdd

# NewsTitle
source: News
cy_gb: Newyddion

source: Next
cy_gb: Ymlaen

# PostPublished
source: Published {0:dd/MM/yyyy}
cy_gb: Cyhoeddwyd {0:dd/MM/yyyy}

source: Previous
cy_gb: Yn ôl

# RecordingsLinkText
source: our YouTube channel
cy_gb: sianel YouTube

# RecordingsPublished
source: Published {0:dd\/MM\/yyyy} at {0:HH\:mm}
cy_gb: Cyhoeddwyd {0:dd\/MM\/yyyy} am {0:HH\:mm}

# RecordingsText
source: Below you can listen to some recordings of the choir. For more please visit
cy_gb: Isod gallwch wrando ar recordiadau o'r côr. Am fwy ymwelwch â'n

# RecordingsTitle
source: Recordings
cy_gb: Recordiadau

# SidebarLatestNews
source: Latest News
cy_gb: Newyddion Diweddaraf

# SidebarLinks
source: Links
cy_gb: Dolenni

# SidebarNewsLink
source: Click here to see all news
cy_gb: Cliciwch yma am fwy o newyddion

# SidebarNoEvents
source: There are no performances scheduled for the near future.
cy_gb: Does dim perfformiadau wedi trefnu yn y dyfodol agos.

# SidebarUpcomingEvents
source: Upcoming Events
cy_gb: Digwyddiadau

# SocialMediaTextFormat
source: Visit our {0} page
cy_gb: Ymwelwch â'n tudalen {0}

# SwitchLanguageLabel
source: Cymraeg
cy_gb: English

# Title
source: Bridgend Tabernacl Choir
cy_gb: Côr Tabernacl Pen-y-bont

# VisitsTitle
source: Exchange Visits
cy_gb: Teithiau Cyfnewid

# WorksText
source: Major choral works performed by the choir since 2001:
cy_gb: Prif weithiau corawl a berfformiwyd gan y côr ers 2001:

# WorksTitle
source: Works
cy_gb: Gweithiau
